[{"id":1,"readmore":"The UK could become Europe's Singapore. That is a worthwhile and achievable ambition.\n\nAllow free access to all imports and scrap VAT, which is nothing more than an internal tariff wall. VAT should in theory raise £130 billion but there is a VAT gap of £20 billion doe to evasion. Of the £110 billion actually collected, all of it is swallowed up in:-\n\n* administrative and compliance costs - 4..7% of the amount collected ie ≈ £5 billion\n* taxpayers' money which has to be paid to public sector employees, pensioners and benefit recipients so that they can pay it back in tax (churning - >£30 billion)\n* deadweight losses - around 10% of GNP if the assumptions behind the IFS Green Budget of 2009 are to be relied on, and consequential losses in government revenue ie  ≈£50 billion.; in Sweden, a cut in VAT on restaurant meals from 25% to 12% resulted in the creation of 11,300 additional jobs. That is one sector in a small country.\n* abstraction of revenue from other taxable sources including Corporation Tax and the UBR\n\nThe country cannot afford this tax. The combination of a VAT-free economy with tariff-free imports is a recipe for the economic success of the UK - which becomes a European Singapore. As part of this ambition, the UK needs also to adopt some features of Singapore's tax system, which has low taxes on everything except real estate ie land.","pitch":"Europe's Singapore"},{"id":2,"readmore":"As all financial forecasts show, a clean break from the EU would be disasterous for Britain. To suggest it is right for the country is ludicrous and my peers and I will bare the burden of it. Instead, It is important that we keep a special relationship with the EU. In doing so, it is likely we will still have to pay contributions, however given the disastrous consequences of a clean break and the 'divorce bill' of billions of pounds, It seems like a small price to pay to keep Britain functioning. I believe that Britain should employ the 'continental partnership' proposal, in which we would have access to the single market and a plethora of other trade benefits whilst also having control of our borders and retaining some of the parliamentary sovereignty which is so coverted. Most people are suggesting that this proposal would still involve a reduced contribution and marginal restrictions on trade deals with other countries, however I see it as a compromise; We get something of financial security and Brexiteers get their control and sovereignty back.The only way for Britain to continue punching above its weight is for us to have a helping hand from the EU. The only way to satisfy the (almost) 15 million voters who wanted to stay in the EU is to compromise a harder Brexit. Our government must push for a continental partnership with the EU for the sake of all parties involved.","pitch":"A 'continental partnership' agreement with the EU."}]
